12/data/attachments/206ecb522bc7060c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_96174e0f-7c12-4fd6-8959-083d7615408d</nif:username>
            <nif:friendToBeAdded>Rodney_who_Friend_85158_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>